<a href="https://colab.research.google.com/github/RsdTanmoy/Machine-Learning-Pandas/blob/main/Pandas_Lecture_8(loc_%26_iloc).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Pandas loc & iloc Method**

In [ ]:
from google.colab import drive
drive.mount('/content/gdrive')

Mounted at /content/gdrive

In [ ]:
import pandas as pd
df=pd.read_csv('/content/gdrive/MyDrive/Pandas/student_results.csv')
df

   Student ID  Class  ...  Mobile Games hrs  Percantege
0        1001     10  ...                 5          50
1        1002     10  ...                 0          80
2        1003     10  ...                 4          60
3        1004     11  ...                 5          45
4        1005     11  ...                 0          75
5        1006     11  ...                 0          96
6        1007     12  ...                 0          80
7        1008     12  ...                 0          90
8        1009     12  ...                 4          60
9        1010     12  ...                 0          85

[10 rows x 7 columns]

**Pandas loc Method**

In [ ]:
df.loc[0]

Student ID                1001
Class                       10
Study hrs                    2
Sleeping hrs                 9
Social Media usage hrs       3
Mobile Games hrs             5
Percantege                  50
Name: 0, dtype: int64

In [ ]:
df.loc[9]

Student ID                1010
Class                       12
Study hrs                    6
Sleeping hrs                 9
Social Media usage hrs       1
Mobile Games hrs             0
Percantege                  85
Name: 9, dtype: int64

In [ ]:
df.loc[[0,2]]

   Student ID  Class  ...  Mobile Games hrs  Percantege
0        1001     10  ...                 5          50
2        1003     10  ...                 4          60

[2 rows x 7 columns]

In [ ]:
df.loc[[0,5,7]]

   Student ID  Class  ...  Mobile Games hrs  Percantege
0        1001     10  ...                 5          50
5        1006     11  ...                 0          96
7        1008     12  ...                 0          90

[3 rows x 7 columns]

In [ ]:
df.loc[7,'Class']

12

In [ ]:
df.loc[0:3,'Class']

0    10
1    10
2    10
3    11
Name: Class, dtype: int64

In [ ]:
df.loc[0:2,'Study hrs']

0    2
1    6
2    3
Name: Study hrs, dtype: int64

In [ ]:
df.loc[df['Class'] > 10]

   Student ID  Class  ...  Mobile Games hrs  Percantege
3        1004     11  ...                 5          45
4        1005     11  ...                 0          75
5        1006     11  ...                 0          96
6        1007     12  ...                 0          80
7        1008     12  ...                 0          90
8        1009     12  ...                 4          60
9        1010     12  ...                 0          85

[7 rows x 7 columns]

In [ ]:
df.loc[df['Class'] < 11]

   Student ID  Class  ...  Mobile Games hrs  Percantege
0        1001     10  ...                 5          50
1        1002     10  ...                 0          80
2        1003     10  ...                 4          60

[3 rows x 7 columns]

In [ ]:
df.loc[df['Class'] < 11,['Percantege']]

   Percantege
0          50
1          80
2          60

**Pandas iloc method**

In [ ]:
df.iloc[0]

Student ID                1001
Class                       10
Study hrs                    2
Sleeping hrs                 9
Social Media usage hrs       3
Mobile Games hrs             5
Percantege                  50
Name: 0, dtype: int64

In [ ]:
df.iloc[2]

Student ID                1003
Class                       10
Study hrs                    3
Sleeping hrs                 8
Social Media usage hrs       2
Mobile Games hrs             4
Percantege                  60
Name: 2, dtype: int64

In [ ]:
df.iloc[[2]]

   Student ID  Class  ...  Mobile Games hrs  Percantege
2        1003     10  ...                 4          60

[1 rows x 7 columns]

In [ ]:
df.iloc[0:2]

   Student ID  Class  ...  Mobile Games hrs  Percantege
0        1001     10  ...                 5          50
1        1002     10  ...                 0          80

[2 rows x 7 columns]

In [ ]:
df.iloc[[0,2]]

   Student ID  Class  ...  Mobile Games hrs  Percantege
0        1001     10  ...                 5          50
2        1003     10  ...                 4          60

[2 rows x 7 columns]

In [ ]:
df.iloc[:,0]

0    1001
1    1002
2    1003
3    1004
4    1005
5    1006
6    1007
7    1008
8    1009
9    1010
Name: Student ID, dtype: int64